OpenDTEF-v1812/tutorials/incompressible/simpleFoam/windAroundBuildings/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication ./Allrun.pre

runApplication decomposePar

restore0Dir -processor

runParallel $(getApplication)

runApplication reconstructPar

#------------------------------------------------------------------------------
